TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ЛабораторныйАнализ/гкс_ЛабораторныйАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЛабораторныйАнализ</name>
  <registerRecords>AccumulationRegister.гкс_ЗаданияНаКомпозитныеПробы</registerRecords>
  <registerRecords>InformationRegister.гкс_ФактическиеПоказателиКачества</registerRecords>
  <registerRecords>InformationRegister.гкс_ВнешниеПробыРегистрации</registerRecords>
  <attributes>
    <name>ВидЛабораторногоАнализа</name>
    <type>
      <types>CatalogRef.гкс_ВидыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбразцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЛабораторногоАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаПолученияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СостояниеТранспортногоСредства</name>
    <type>
      <types>EnumRef.гкс_СоответствиеТребованиям</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативнаяСертификация</name>
    <type>
      <types>DocumentRef.гкс_НормативнаяСертификацияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СоответствуетНормативу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонениеОтБазиса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <comment>ERP-1475</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСоотвествия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсиленныйКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонятьКачество</name>
      <comment>При отклонении от нормы - отклонять качество</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗначениеВнешнейПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьВнешниеПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешняяПроба</name>
      <type>
        <types>DocumentRef.гкс_ВнешняяПроба</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяСуммаВнешнейПробы</name>
      <comment>Контрольная сумма MD5</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиДляПерепроверки</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеИспользованияКачества</name>
      <type>
        <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродуктоваяГруппа</name>
    <type>
      <types>CatalogRef.гкс_ПродуктоваяГруппа</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКачества</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_ЛабораторныйАнализЛокализация_by/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ПодключаемыеКоманды

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Акт возврата		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 	= "ПФ_MXL_АктВозврата_by";
	КомандаПечати.Представление 	= НСтр("ru = 'Акт возврата'");
    КомандаПечати.МенеджерПечати 	= "Обработка.гкс_ПечатьАктВозврата_Беларусь";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик  		= "гкс_УправлениеПечатьюКлиент_by.ВыполнитьКомандуПечати_АктВозврата";
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// Функция получает данные для формирования Акта возврата Беларусь
// Возвращает данные, необходимые для печатной формы.
// 
// Параметры:
//	МассивОбъектов - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - Массив ссылок на документы РегистрацияНаПЛК, по которым необходимо получить данные.
//
// Возвращаемое значение:
//	Структура:
//	 * РезультатПоШапке - РезультатЗапроса
//	 * РезультатПоТабличнойЧасти - РезультатЗапроса
// 
Функция ДанныеДляПечатнойФормыАктВозврата(МассивОбъектов) Экспорт 
	
	    ПакетаЗапроса2 = 2;
	    ПакетаЗапроса3 = 3;
	    
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЛабораторныйАнализ.Ссылка КАК ЛабАнализ,
			|	ЛабораторныйАнализ.Номер КАК НомерЛабАнализ,
			|	ЛабораторныйАнализ.Дата КАК ДатаЛабАнализ,
			|	РегистрацияНаПЛК.Водитель КАК Водитель,
			|	ЛабораторныйАнализ.Номенклатура.НаименованиеДляПечати КАК Номенклатура,
			|	ЛабораторныйАнализ.Номенклатура КАК НоменклатураСсылка,
			|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
			|	РегистрацияНаПЛК.ВесНетто КАК Количество,
			|	РегистрацияНаПЛК.НомерДокументаПоставщика КАК НомерТН,
			|	НАЧАЛОПЕРИОДА(РегистрацияНаПЛК.ДатаДокументаПоставщика, ДЕНЬ) КАК ДатаТН,
			|	РегистрацияНаПЛК.Контрагент КАК Поставщик,
			|	ЕСТЬNULL(НормативнаяСертификацияНоменклатуры.ГОСТ, """") КАК НомерСТБ,
			|	ЕСТЬNULL(НормативнаяСертификацияНоменклатуры.Ссылка, """") КАК НормативнаяСертификация,
			|	ЕСТЬNULL(СправочникНоменклатура.ПродуктоваяГруппа, """") КАК ПродуктоваяГруппа
			|ПОМЕСТИТЬ ВТ_ОсновныеДанные
			|ИЗ
			|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
			|		ПО ЛабораторныйАнализ.гкс_ДокументРегистрации = РегистрацияНаПЛК.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры КАК НормативнаяСертификацияНоменклатуры
			|		ПО ЛабораторныйАнализ.Номенклатура = НормативнаяСертификацияНоменклатуры.Номенклатура
			|		И
			|			НормативнаяСертификацияНоменклатуры.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка)
			|		И
			|			НормативнаяСертификацияНоменклатуры.гкс_ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.Автомобиль)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
			|		ПО ЛабораторныйАнализ.Номенклатура = СправочникНоменклатура.Ссылка
			|ГДЕ
			|	ЛабораторныйАнализ.Ссылка В (&МассивОбъектов)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЛабАнализ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.Показатель, """") КАК Показатель,
			|	ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.Значение, """") КАК Значение,
			|	ВТ_ОсновныеДанные.ЛабАнализ КАК ЛабАнализ,
			|	ВТ_ОсновныеДанные.НормативнаяСертификация КАК НормативнаяСертификация
			|ПОМЕСТИТЬ ВТ_ЛабАнализ
			|ИЗ
			|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
			|		ПО ВТ_ОсновныеДанные.ЛабАнализ = ЛабораторныйАнализКачественныеПоказатели.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ЛабАнализ.Показатель КАК Показатель,
			|	ЕСТЬNULL(НормативнаяСертификацияНоменклатурыАнализы.МаксЗначениеПоказателя, """") КАК НормЗначение,
			|	ВТ_ЛабАнализ.Значение КАК ФактЗначение,
			|	ВТ_ЛабАнализ.ЛабАнализ КАК ЛабАнализ
			|ИЗ
			|	ВТ_ЛабАнализ КАК ВТ_ЛабАнализ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК
			|			НормативнаяСертификацияНоменклатурыАнализы
			|		ПО ВТ_ЛабАнализ.НормативнаяСертификация = НормативнаяСертификацияНоменклатурыАнализы.Ссылка
			|		И ВТ_ЛабАнализ.Показатель = НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа
			|ИТОГИ
			|ПО
			|	ЛабАнализ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОсновныеДанные.ЛабАнализ КАК ЛабАнализ,
			|	ВТ_ОсновныеДанные.НомерЛабАнализ КАК НомерЛабАнализ,
			|	ВТ_ОсновныеДанные.ДатаЛабАнализ КАК ДатаЛабАнализ,
			|	ВТ_ОсновныеДанные.Водитель КАК Водитель,
			|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
			|	ВТ_ОсновныеДанные.НоменклатураСсылка КАК НоменклатураСсылка,
			|	ВТ_ОсновныеДанные.ТранспортноеСредство КАК ТранспортноеСредство,
			|	ВТ_ОсновныеДанные.Количество КАК Количество,
			|	ВТ_ОсновныеДанные.НомерТН КАК НомерТН,
			|	ВТ_ОсновныеДанные.ДатаТН КАК ДатаТН,
			|	ВТ_ОсновныеДанные.Поставщик КАК Поставщик,
			|	ВТ_ОсновныеДанные.НомерСТБ КАК НомерСТБ,
			|	ВТ_ОсновныеДанные.НормативнаяСертификация КАК НормативнаяСертификация,
			|	ВТ_ОсновныеДанные.ПродуктоваяГруппа КАК ПродуктоваяГруппа
			|ИЗ
			|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные";
		
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
		РезультатПакетаЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
		Возврат Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти", РезультатПакетаЗапросов[ПакетаЗапроса3],
			РезультатПакетаЗапросов[ПакетаЗапроса2]);
	
КонецФункции

#КонецОбласти

#КонецОбласти
